lexicon_ru = {
    "start": "Привет! 😄\nУ вас нет карт для тренировок. Хотите добавить?",
    "start_alternative": "С возвращением! 😁 \nИспользуйте кнопки ниже, чтобы войти в режим.",
    "view_cards": "У вас нет добавленных карт. ❌\nДобавьте их через соответствующий пункт в меню",
    "reset_trained_cards": "Нет выученных карт, которые можно сбросить. ❌",
    "reset_trained_cards_success": "{count} карт сброшены. ✅\nТеперь можно повторить их снова.",
    "card_service": {
        "front_input": "<b>Передняя сторона сохранена</b>! ✅\n<i>Теперь введите обратную сторону.</i>",
        "input_result": "<b>Карта была создана!</b> ✅"
        "\n<i>Передняя сторона:</i> {front}"
        "\n<i>Задняя сторона:</i> {text}",
        "add_user_set_result": "<b>{converted_cards} карт(ы) успешно добавлены!</b> ✅",
        "error_card": "Произошла ошибка при добавлении карт. ❌",
    },
    "create_cards": {
        "entry": "Выберите режим с помощью которого хотели бы загрузить новые слова 🧭",
        "face_input": "Введите лицевую сторону карты",
        "error": "Произошла ошибка, попробуйте позже ❌",
        "auto_mode": "Выбран автоматический режим для загрузки"
        "\nЗагрузите пары разделенные символом <b>'-.-'</b>"
        "\nКаждая новая строчка должна начинаться с новой строки",
        "auto_mode_exit": "Вы вышли из режима автоматического добавления карт 🚪",
    },
    "train_mode": {
        "entry": "Выберите режим тренировки в выпавшем меню 🧭",
        "exit_mode": "Завершен режим тренировки 🚪",
        "exit_mode_error": "Ошибка, не смогли завершить процесс тренировки ❌",
        "no_more_cards_to_study": "Нет доступных карт для тренировки ❌",
        "all_cards_viewed": "Вы просмотрели все добавленные карты ✅",
        "error_card_user_state": "Возникла проблема с получением состояния пользователя или карты ❌",
        "error_card": "Ошибка при получении карты ❌",
        "success": "Вы выучили все карты, поздравляем! 🔥",
    },
    "keyboards": {
        "create_cards_keyboards": {
            "manual": "Добавить вручную 🤏",
            "auto": "Загрузить пакетом 💻",
            "finish_uploading_session": "Завершить добавление 🚪",
        },
        "start_keyboard": {
            "view_cards": "Просмотреть карты 👀",
            "create_cards": "Добавить карты 🧾",
            "train_cards": "Режим тренировки 📕",
            "reset_trained_cards": "Сбросить прогресс ⭕",
        },
        "trainer_inline": {
            "counter": "{difference}/{total_cards}",
            "flip_card": "Перевернуть ↩",
            "flip_inverted": "Перевернуть ↪",
            "mark_studied": "Выучено ✅",
            "next_card": "Следующая карта ⏩",
            "exit": "Выйти 🚪",
        },
        "trainer_keyboard": {
            "classic": "Тренировка с картами",
            "test": "Тренировка с тестами",
        },
    },
}
